<template>
    <my-page title="DNS检测/查询记录 - 帮助" backable>
        <ui-article>
            <h2>说明</h2>

            <p><strong>名称服务器[NS]记录</strong></p>
            <p>描述：无。</p>

            <p><strong>2.主机[A]记录</strong></p>
            <p>描述: 主机地址记录。在 DNS 域名与 IP 地址之间建立映射关系。</p>

            <p><strong>3.别名[CNAME]</strong></p>
            <p>描述: 用来表示用在该区域中的其它资源记录类型中已指定名称的替补或别名 DNS 域名。</p>

            <p><strong>4.邮件交换[MX]记录</strong></p>
            <p>描述: 用来向特定邮件交换器提供消息路由，该主机作为指定 DNS 域名的邮件交换器。
                MX 记录需要一个16-位整数来表示消息路由中的主机优先级，多个邮件交换在消息一中被指定。对于这个记录类型中的每个邮件交换主机，需要一个相应的主机地址类型记录。</p>

            <p><strong>3.主机信息[HINFO]</strong></p>
            <p>描述: 用来说明映射到特定 DNS 主机名的 CPU 类型和操作系统类型的 RFC-1700 保留字符串类型，
                这个信息可以被应用程序通信协议使用。</p>

            <p><strong>5.邮箱或通信信息 MINFO</strong></p>
            <p>描述: 用来指定负责维护该记录中特定通信名单或邮箱的联系域邮箱名称。同时，还被用来指定接收与该记录中特定通信名单或邮箱有关的错误信息的邮箱。</p>

            <p><strong>8.服务记录 [SRV]</strong></p>
            <p>描述: SRV 资源记录允许管理员使用单一 DNS 域的多个服务器，容易的用管理功能将 TCP/IP 服务从一个主机移到另一个主机，并且将服务提供的程序主机分派为服务的主服务器，将其它的分派为辅助的</p>
        </ui-article>
    </my-page>
</template>
